In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import linear_model

In [6]:
rf = pd.read_csv('excercise1.csv')
rf

   car_model  mileage  sell_price  age
0     BMW X5    69000       18000    6
1     BMW X5    35000       34000    3
2     BMW X5    57000       26100    5
3     BMW X5    22500       40000    2
4    Audi A5    46000       31500    4
5    Audi A5    59000       29400    5
6    Audi A5    52000       32000    5
7    Audi A5    72000       19300    6
8    Audi A5    91000       12000    8
9   Mercedez    67000       22000    6
10  Mercedez    83000       20000    7
11  Mercedez    79000       21000    7
12  Mercedez    59000       33000    5

In [7]:
rdf=rf.drop(['car_model'], axis='columns')
rdf

    mileage  sell_price  age
0     69000       18000    6
1     35000       34000    3
2     57000       26100    5
3     22500       40000    2
4     46000       31500    4
5     59000       29400    5
6     52000       32000    5
7     72000       19300    6
8     91000       12000    8
9     67000       22000    6
10    83000       20000    7
11    79000       21000    7
12    59000       33000    5

In [9]:
x= rdf.drop(['sell_price'],axis='columns')
x

    mileage  age
0     69000    6
1     35000    3
2     57000    5
3     22500    2
4     46000    4
5     59000    5
6     52000    5
7     72000    6
8     91000    8
9     67000    6
10    83000    7
11    79000    7
12    59000    5

In [10]:
y=rdf.sell_price
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: sell_price, dtype: int64

In [13]:
from sklearn.model_selection import train_test_split

In [26]:
x_train, x_test, y_train, y_test= train_test_split(x,y,test_size=0.2)

In [27]:
len(x_train)

10

In [28]:
len(y_test)

3

In [29]:
len(x_test)

3

In [32]:
x_train

    mileage  age
2     57000    5
6     52000    5
1     35000    3
3     22500    2
0     69000    6
4     46000    4
10    83000    7
12    59000    5
7     72000    6
5     59000    5

In [22]:
y_train

12    33000
6     32000
5     29400
4     31500
0     18000
1     34000
3     40000
8     12000
7     19300
9     22000
Name: sell_price, dtype: int64

In [21]:
from sklearn.linear_model import LinearRegression
clf= LinearRegression()

In [33]:
clf.fit(x_train,y_train)

LinearRegression()

In [34]:
clf.predict(x_test)

array([15670.78040934, 24438.57119086, 20054.6758001 ])

In [36]:
clf.score(x_train,y_train)

0.8041894752848093

In [38]:
y_test

8     12000
9     22000
11    21000
Name: sell_price, dtype: int64